Backend/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up traffic"
    - duration: 60
      arrivalRate: 100
      name: "Sustained load"
    - duration: 30
      arrivalRate: 100
      rampTo: 0
      name: "Ramp down"
  payload:
    path: "tokens.csv"
    fields:
      - "token"
    order: "sequence"

scenarios:
  - name: "Authenticated 100-User Load Test"
    flow:
      - get:
          url: "/api/interview/model-info"
          headers:
            cookie: "token={{ token }}"